def hallo():
    print("hallo")


def number(number1, number2):
    return number1 + number2


# בפייתון יש הבדל בין פונקציה למתודה:
# פונקציה היא פעולה כללית אשר מקבלת פרמטרים לפי הגדרת הפונקציה
# מתודה היא באופן דומה פונקציה אשר מקבלת פרמטרים לפי הגדרתה אך משוייכת לאובייקט מסויים, זאת אומרת שהמתודה מקבלת מראש את האובייקט כפרמטר
# לדוגמה ישנן מתודות מובנות בפייתון ששייכות למחרוזות


word = 'you are talking'
print(word.upper())  # מדפיס את המחרוזת באותיות גדולות
print(word.lower())  # מדפיס את המחרוזת באותיות קטנות
word2 = word.upper()  # ניתן גם לבצע השמה של פעולת המתודה
print(word.islower())  # שאילתא האם המחרוזת באותיות קטנות
print(word.capitalize())  # יגרום לאות הראשונה במחרוזת להיות גדולה
print(word.title())  # יגדיל כל אות ראשונה במילים במחרוזת

# מתודה SPLIT
word3 = 'Hallo. I am nina'
print(word3.split('.'))  # פיצול המחרוזת לפי התו נקודה. המתודה מחזירה רשימה שבה נמצאים שתי המחרוזות בנפרד

# Partition פונקציה שמחלקת את המחרוזת לפי מה שהיה לפניה ואחריה
print(word3.partition('I'))  # המתודה תחזיר רשימה של 3 מחרוזות לפי החלוקה

# Len - מחזירה את כמות האותיות במחרוזת
print(len(word))

# SORTED - מחזירה רשימה שבה האותיות של המחרוזת בצורה ממוינת
print(sorted(word))
print(sorted(word, reverse=True))

# הורדת רווחים לפני ואחרי המילה
word4 = "   Here I am   "
print(word4.lstrip())#לפני המילה
print(word4.rstrip())# אחרי המילה
print(word4.strip())# מוריד רווחים לפני ואחרי

#החלפת תו מסויים במחרוזת בתו אחר
print(word4.replace('e','\\'))

#המתודה dir תחזיר רשימה שבה כל שמות המתודות שקיימות בפייתון עבור המשתנה שהתקבל, במקרה שלמטה עבור מחרוזת
print(dir(word4))




if __name__ == '__main__':  # זוהי שורת פתיחה של התוכנית
    hallo()
    print(number(2, 3))
    __name__ = "nina"
